In [2]:
import pandas as pd

In [3]:
## pandas have 2 data types:

series = pd.Series(['Audi', 'Tesla', 'Toyota', 'Honda'])

In [4]:
series

0      Audi
1     Tesla
2    Toyota
3     Honda
dtype: object

## series are single-dimensional

In [5]:
series = pd.Series(['IK', 'Kola', 'Tope', 'Deola', 'Lade'])

In [6]:
series

0       IK
1     Kola
2     Tope
3    Deola
4     Lade
dtype: object

In [7]:
my_circle = pd.DataFrame({'person': series, 'year': 2021})

In [8]:
my_circle

  person  year
0     IK  2021
1   Kola  2021
2   Tope  2021
3  Deola  2021
4   Lade  2021

## pandas take data in two ways: hardcoded data or imported data

In [9]:
data = pd.read_csv("car-sales.csv")

In [10]:
car_deets = pd.DataFrame(data)

In [11]:
car_deets

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

## or the easier way

In [12]:
car_details = pd.read_csv('car-sales.csv')

In [13]:
car_details

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

## exporting a csv file

car_details.to_csv("analysed-file.csv")

In [14]:
car_details.to_csv('analysed-file.csv', index=False)

## re-import the exported file

In [38]:
exported_car_sales = pd.read_csv('analysed-file.csv')
exported_car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

## Data Description

In [16]:
car_details.dtypes

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price            object
dtype: object

In [17]:
columns = car_details.columns
columns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [18]:
car_details.index

RangeIndex(start=0, stop=10, step=1)

## functions: they do something to your data

In [19]:
car_details.describe()

       Odometer (KM)      Doors
count      10.000000  10.000000
mean    78601.400000   4.000000
std     61983.471735   0.471405
min     11179.000000   3.000000
25%     35836.250000   4.000000
50%     57369.000000   4.000000
75%     96384.500000   4.000000
max    213095.000000   5.000000

In [20]:
car_details.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Make           10 non-null     object
 1   Colour         10 non-null     object
 2   Odometer (KM)  10 non-null     int64
 3   Doors          10 non-null     int64
 4   Price          10 non-null     object
dtypes: int64(2), object(3)
memory usage: 528.0+ bytes

In [21]:
car_details.mean()

C:\Users\this\AppData\Local\Temp/ipykernel_14028/2333902812.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  car_details.mean()

Odometer (KM)    78601.4
Doors                4.0
dtype: float64

In [22]:
car_details.median()

C:\Users\this\AppData\Local\Temp/ipykernel_14028/53786296.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  car_details.median()

Odometer (KM)    57369.0
Doors                4.0
dtype: float64

In [23]:
car_details.count()

Make             10
Colour           10
Odometer (KM)    10
Doors            10
Price            10
dtype: int64

In [24]:
car_details.std()

C:\Users\this\AppData\Local\Temp/ipykernel_14028/3948502742.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  car_details.std()

Odometer (KM)    61983.471735
Doors                0.471405
dtype: float64

In [25]:
 car_details.describe()

       Odometer (KM)      Doors
count      10.000000  10.000000
mean    78601.400000   4.000000
std     61983.471735   0.471405
min     11179.000000   3.000000
25%     35836.250000   4.000000
50%     57369.000000   4.000000
75%     96384.500000   4.000000
max    213095.000000   5.000000

In [26]:
car_details['Odometer (KM)'].sum()

786014

In [27]:
car_details['Doors'].mean()

4.0

In [28]:
car_details['Odometer (KM)'].mode()

0     11179
1     31600
2     32549
3     45698
4     54738
5     60000
6     87899
7     99213
8    150043
9    213095
dtype: int64

In [29]:
len(car_details)

10

In [30]:
len(car_details['Doors'])

10

## Viewing and Selecting Data

In [31]:
car_details

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [39]:
## .loc refers to index

car_details.loc[4]

Make                Nissan
Colour               White
Odometer (KM)       213095
Doors                    4
Price            $3,500.00
Name: 4, dtype: object

In [40]:
## .iloc refers to position

car_details.iloc[4]

Make                Nissan
Colour               White
Odometer (KM)       213095
Doors                    4
Price            $3,500.00
Name: 4, dtype: object

In [41]:
car_details[car_details['Make'] == 'Nissan']

     Make Colour  Odometer (KM)  Doors      Price
4  Nissan  White         213095      4  $3,500.00
9  Nissan  White          31600      4  $9,700.00

In [42]:
car_details[:4]

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00

In [43]:
car_details[:4:2]

     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White         150043      4  $4,000.00
2  Toyota   Blue          32549      3  $7,000.00

In [45]:
car_details[car_details['Colour'] != 'White']

     Make Colour  Odometer (KM)  Doors       Price
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00